# این  فایل حاوی اطلاعات مشتریان یک بازاریاب مستقیم است.
#DirectMarketing(mini).csv
# بازاریاب محصولات خود را با استفاده از پست مستقیم به فروش می‌رساند.
# او کاتالوگ محصولات را به 1000 نفر ارسال کرده و مشتریان با تلفن، محصولات مورد نیازشان را سفارش می‌دهند.
# بازاریاب داده‌های مشتریان را جمع‌آوری کرده و هدفش بررسی عواملی است که باعث می‌شود برخی مشتریان بیشتر از دیگران خرید کنند.

# متغیرهای موجود در این فایل داده عبارتند از:

# Gender: دسته‌بندی جنسیتی مشتری (زن یا مرد)
# OwnHome: مالک یا مستأجر بودن مشتری
# Married: وضعیت تاهل مشتری (مجرد یا متأهل)
# Salary: حقوق سالیانه مشتری به دلار
# Children: تعداد فرزندان مشتری
# Catalogs: تعداد کاتالوگ‌های ارسالی به مشتری
# AmountSpent: میزان خرید مشتری به دلار




getwd()
setwd(dir = "C:/Users/Abolfazl-Pc/Documents")
my_data <- read.csv("DirectMarketing(mini).csv" , header = TRUE)
my_data
Sal <- my_data$Salary
Sal